; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v1)
             (pred_5 ?v4 ?v13)
             (pred_1 ?v8 ?v13)
             (pred_11 ?v12 ?v8 )
	     (pred_8 ?v8)
             (pred_6 ?v7)
             (pred_4 ?v4)
             (pred_9 ?v13)
             (pred_3 ?v8)
             (pred_12 ?v4)
             (pred_10 ?v8)
             (pred_7 ))



(:action op_3
:parameters (?v10 ?v9 ?v11 ?v6)
:precondition (and (pred_6 ?v10) (pred_6 ?v9) (pred_4 ?v11) (pred_9 ?v6)
          (pred_2 ?v10 ?v9) (pred_5 ?v11 ?v6)
                   (pred_1 ?v9 ?v6) (pred_8 ?v10) 
                   (pred_3 ?v9) (pred_12 ?v11))
:effect (and  (pred_10 ?v9) (not (pred_3 ?v9))))


(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_6 ?v10) (pred_6 ?v5)
               (pred_8 ?v10) (pred_2 ?v10 ?v5) (pred_10 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v10))))

(:action op_5
:parameters (?v10 ?v11)
:precondition (and (pred_6 ?v10) (pred_4 ?v11) 
                  (pred_8 ?v10) (pred_11 ?v11 ?v10) (pred_7 ))
:effect (and (pred_12 ?v11)
   (not (pred_11 ?v11 ?v10)) (not (pred_7 ))))


(:action op_2
:parameters (?v10 ?v2 ?v3)
:precondition (and (pred_6 ?v10) (pred_4 ?v2) (pred_4 ?v3)
                  (pred_8 ?v10) (pred_12 ?v3) (pred_11 ?v2 ?v10))
:effect (and (pred_12 ?v2) (pred_11 ?v3 ?v10)
        (not (pred_12 ?v3)) (not (pred_11 ?v2 ?v10))))

(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_6 ?v10) (pred_4 ?v11) 
                  (pred_8 ?v10) (pred_12 ?v11))
:effect (and (pred_7 ) (pred_11 ?v11 ?v10) (not (pred_12 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_18 obj_29 obj_13 obj_05 obj_01 obj_04 obj_11 obj_07 obj_06 obj_09 obj_17 obj_22 obj_20 obj_19 obj_21 obj_14 obj_30 obj_23 obj_10 obj_26 obj_24 obj_03 obj_31 obj_16
    obj_02 obj_25 obj_15
    obj_27 obj_08 obj_12
    )

    (:init
       (pred_7)

       (pred_6 obj_28)
       (pred_6 obj_18)
       (pred_6 obj_29)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_11)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_22)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_30)
       (pred_6 obj_23)
       (pred_6 obj_10)
       (pred_6 obj_26)
       (pred_6 obj_24)
       (pred_6 obj_03)
       (pred_6 obj_31)
       (pred_6 obj_16)
       (pred_9 obj_02)
       (pred_9 obj_25)
       (pred_9 obj_15)
       (pred_4 obj_27)
       (pred_4 obj_08)
       (pred_4 obj_12)

       (pred_2 obj_28 obj_01)
       (pred_2 obj_28 obj_18)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_18 obj_29)
       (pred_2 obj_18 obj_28)
       (pred_2 obj_29 obj_11)
       (pred_2 obj_29 obj_13)
       (pred_2 obj_29 obj_18)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_29)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_01 obj_28)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_11 obj_29)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_09 obj_21)
       (pred_2 obj_09 obj_17)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_09)
       (pred_2 obj_22 obj_30)
       (pred_2 obj_22 obj_20)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_20 obj_23)
       (pred_2 obj_20 obj_19)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_20 obj_22)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_20)
       (pred_2 obj_21 obj_26)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_09)
       (pred_2 obj_14 obj_24)
       (pred_2 obj_14 obj_30)
       (pred_2 obj_14 obj_17)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_30 obj_03)
       (pred_2 obj_30 obj_23)
       (pred_2 obj_30 obj_22)
       (pred_2 obj_30 obj_14)
       (pred_2 obj_23 obj_31)
       (pred_2 obj_23 obj_10)
       (pred_2 obj_23 obj_20)
       (pred_2 obj_23 obj_30)
       (pred_2 obj_10 obj_16)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_10 obj_23)
       (pred_2 obj_26 obj_24)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_24 obj_03)
       (pred_2 obj_24 obj_14)
       (pred_2 obj_24 obj_26)
       (pred_2 obj_03 obj_31)
       (pred_2 obj_03 obj_30)
       (pred_2 obj_03 obj_24)
       (pred_2 obj_31 obj_16)
       (pred_2 obj_31 obj_23)
       (pred_2 obj_31 obj_03)
       (pred_2 obj_16 obj_10)
       (pred_2 obj_16 obj_31)
       (pred_3 obj_31)
       (pred_3 obj_11)
       (pred_3 obj_24)
       (pred_1  obj_31 obj_02)
       (pred_1  obj_11 obj_25)
       (pred_1  obj_24 obj_15)
       (pred_10 obj_28)
       (pred_10 obj_18)
       (pred_10 obj_29)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_07)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_10 obj_22)
       (pred_10 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_21)
       (pred_10 obj_14)
       (pred_10 obj_30)
       (pred_10 obj_23)
       (pred_10 obj_10)
       (pred_10 obj_26)
       (pred_10 obj_03)
       (pred_10 obj_16)

       (pred_5  obj_27 obj_02)
       (pred_5  obj_08 obj_25)
       (pred_5  obj_12 obj_15)
       (pred_11 obj_27 obj_14)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_12 obj_05)
       (pred_8 obj_06)
    )

    (:goal (and
       (pred_11 obj_27 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_30)))
)
)

; plan
1. (op_4 obj_06 obj_07)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_07)
   goals met: 0 of 1
2. (op_4 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 0 of 1
3. (op_4 obj_20 obj_23)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_23)
   goals met: 0 of 1
4. (op_5 obj_23 obj_08)
   deleted: (pred_11 obj_08 obj_23) (pred_7)
   added: (pred_12 obj_08)
   goals met: 0 of 1
5. (op_4 obj_23 obj_20)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_20)
   goals met: 0 of 1
6. (op_1 obj_20 obj_08)
   deleted: (pred_12 obj_08)
   added: (pred_7) (pred_11 obj_08 obj_20)
   goals met: 0 of 1
7. (op_4 obj_20 obj_22)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_22)
   goals met: 0 of 1
8. (op_4 obj_22 obj_17)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_17)
   goals met: 0 of 1
9. (op_4 obj_17 obj_14)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_14)
   goals met: 0 of 1
10. (op_5 obj_14 obj_27)
   deleted: (pred_11 obj_27 obj_14) (pred_7)
   added: (pred_12 obj_27)
   goals met: 0 of 1
11. (op_4 obj_14 obj_17)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_17)
   goals met: 0 of 1
12. (op_4 obj_17 obj_22)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_22)
   goals met: 0 of 1
13. (op_4 obj_22 obj_20)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_20)
   goals met: 0 of 1
14. (op_2 obj_20 obj_08 obj_27)
   deleted: (pred_12 obj_27) (pred_11 obj_08 obj_20)
   added: (pred_12 obj_08) (pred_11 obj_27 obj_20)
   goals met: 1 of 1
